FV2304/E_0475.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
GPKE

6.38.1: AD: Konfigurationsänderung zwischen MSB aufgrund Bilanzierungsverfahrensänderung



end title
:<b>E_0475</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>1: </b> Handelt es sich bei der Marktlokation um eine verbrauchende Marktlokation?) then (ja)
else (nein)
    :A07;
    note left
        Cluster: Ablehnung
        Bestellungen sind nur für verbrauchende Marktlokationen möglich
    endnote
    kill;
endif
if (<b>2: </b> Wurde ein Messprodukt mit Zählzeit des LF abbestellt?) then (ja)
else (nein)
    if (<b>3: </b> Wurde zum gewünschten Messprodukt zum Anwendungszeitpunkt eine Zählzeit bestellt?) then (ja)
        if (<b>4: </b> Ist die gewünschte Zählzeit zum Anwendungszeitpunkt Bestandteil der Übersicht der Zählzeitdefinition, welche zuvor vom NB bzw. vom LF übermittelt wurde?) then (ja)
        else (nein)
            :A01;
            note left
                Cluster: Ablehnung 
                Zählzeitdefinition zum Anwendungszeitpunkt nicht bekannt
            endnote
            kill;
        endif
        if (<b>5: </b> Liegt zum Anwendungszeitpunkt die ausgerollte Zählzeit zur Zählzeitdefinition vor?) then (ja)
        else (nein)
            :A02;
            note left
                Cluster: Ablehnung 
                Ausgerollte Zählzeit zur Zählzeitdefinition liegt zum Anwendungszeitpunkt nicht vor
            endnote
            kill;
        endif
        if (<b>6: </b> Ist die gewünschte Konfiguration zum gewünschten Termin bereits umgesetzt?) then (ja)
            :A03;
            note left
                Cluster: Ablehnung 
                Gewünschte Gerätekonfiguration liegt zum Termin bereits vor.
            endnote
            kill;
        else (nein)
        endif
        if (<b>7: </b> Wurde die Vorlauffristen zu der geplanten Änderung der Gerätekonfiguration eingehalten?) then (ja)
        else (nein)
            :A04;
            note left
                Cluster: Ablehnung 
                Fristüberschreitung
            endnote
            kill;
        endif
        if (<b>8: </b> Wurde eine Zählzeit des LF bestellt?) then (ja)
            if (<b>9: </b> Ist ein iMS verbaut?) then (ja)
            else (nein)
                :A05;
                note left
                    Cluster: Ablehnung 
                    Zählzeiten des LF nur bei iMS möglich
                endnote
                kill;
            endif
            if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                :A99;
                note left
                    Cluster: Ablehnung 
                    Sonstiges
                    Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                    Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
                endnote
                kill;
            else (nein)
                :Parametrierung durchführen;
                kill;
            endif
        else (nein)
            if (<b>10: </b> Ist die Gerätekonfiguration möglich? (z.B. kME ist eingebaut und Konfiguration ist möglich&#41;) then (ja)
            else (nein)
                :A06;
                note left
                    Cluster: Ablehnung 
                    Gerätekonfiguration technisch nicht möglich
                    Hinweis: z. B. Zählzeit bestellt und Eintarifzähler verbaut
                endnote
                kill;
            endif
            if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                :A99;
                note left
                    Cluster: Ablehnung 
                    Sonstiges
                    Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                    Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
                endnote
                kill;
            else (nein)
                :Parametrierung durchführen;
                kill;
            endif
        endif
        if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
            :A99;
            note left
                Cluster: Ablehnung 
                Sonstiges
                Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
                Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
            endnote
            kill;
        else (nein)
            :Parametrierung durchführen;
            kill;
        endif
    else (nein)
    endif
endif
if (<b>6: </b> Ist die gewünschte Konfiguration zum gewünschten Termin bereits umgesetzt?) then (ja)
    :A03;
    note left
        Cluster: Ablehnung 
        Gewünschte Gerätekonfiguration liegt zum Termin bereits vor.
    endnote
    kill;
else (nein)
endif
if (<b>7: </b> Wurde die Vorlauffristen zu der geplanten Änderung der Gerätekonfiguration eingehalten?) then (ja)
else (nein)
    :A04;
    note left
        Cluster: Ablehnung 
        Fristüberschreitung
    endnote
    kill;
endif
if (<b>8: </b> Wurde eine Zählzeit des LF bestellt?) then (ja)
    if (<b>9: </b> Ist ein iMS verbaut?) then (ja)
    else (nein)
        :A05;
        note left
            Cluster: Ablehnung 
            Zählzeiten des LF nur bei iMS möglich
        endnote
        kill;
    endif
    if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung 
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :Parametrierung durchführen;
        kill;
    endif
else (nein)
    if (<b>10: </b> Ist die Gerätekonfiguration möglich? (z.B. kME ist eingebaut und Konfiguration ist möglich&#41;) then (ja)
    else (nein)
        :A06;
        note left
            Cluster: Ablehnung 
            Gerätekonfiguration technisch nicht möglich
            Hinweis: z. B. Zählzeit bestellt und Eintarifzähler verbaut
        endnote
        kill;
    endif
    if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        :A99;
        note left
            Cluster: Ablehnung 
            Sonstiges
            Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
            Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
        endnote
        kill;
    else (nein)
        :Parametrierung durchführen;
        kill;
    endif
endif
if (<b>11: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    :A99;
    note left
        Cluster: Ablehnung 
        Sonstiges
        Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
        Nutzungsmöglichkeit Ende: 01.10.2023 00:00 Uhr
    endnote
    kill;
else (nein)
    :Parametrierung durchführen;
    kill;
endif

@enduml
